var store = [{
        "title": "github.io 블로그 시작하기",
        "excerpt":"12월을 시작하면서 블로그를 다시 처음 부터 시작하려고 한다. 죽이 되든 밥이 되든 여기가 내 평생 정착지가 되어야만 한다.✨ Github.io는 재밌으면서도 귀찮으면서도 뿌듯함이 공존하는 블로그다. 일년 뒤에 돌아봤을 때에는 성실함이 묻어나는 블로그가 되길 소망한다. 아직 댓글기능이랑, 글 날짜 보여주기, About 페이지 등등 좀 더 고쳐나가야 할게 많다. 부담가지지 말고 한개씩 추가해야겠다…...","categories": ["Blog"],
        "tags": ["Blog"],
        "url": "/blog/start/",
        "teaser": null
      },{
        "title": "Spring이란?",
        "excerpt":"1. Spring 이란? Spring 은 특정한 하나를 뜻하는게 아니라, 여러 기술들의 모음이라고 볼 수 있다. Ex) 스프링 홈페이지 스프링 프레임워크, 스프링 부트를 포함하여, 프스필 데이터, 스프링 세션, 스프링 시큐리티 등..을 포함한다. 가장 큰 핵심은 스프링 프레임워크이고 ,이를 편리하게 쓸 수 있도록 하는게 스프링 부트이다. 요즘은 스프링 부트를 주로 활용해서 스프링...","categories": ["Spring"],
        "tags": [],
        "url": "/spring/spring%EC%9D%B4%EB%9E%80/",
        "teaser": null
      },{
        "title": "Java 버전 바꾸기",
        "excerpt":"자바 버전 바꾸기 Mac OS에는 여러 버전의 자바를 설치하고, 상황에 따라 버전을 바꾸어 가며 사용할 수 있다. 자바 여러 버전 설치하는 방법 내가 사용 했던 방식은 총 두가지 이다. 홈페이지 가서 다운로드 받기 homebrew로 설치하기 1. 홈페이지 가서 다운로드 받기  ☕️ Java 홈페이지 에 가서 자신이 필요한 파일을 다운로드 받은...","categories": ["Setting"],
        "tags": [],
        "url": "/setting/Java%EB%B2%84%EC%A0%84%EB%B0%94%EA%BE%B8%EA%B8%B0/",
        "teaser": null
      }]
