var store = [{
        "title": "[Daily] github.io 블로그 시작하기",
        "excerpt":"12월을 시작하면서 블로그를 다시 처음 부터 시작하려고 한다. 죽이 되든 밥이 되든 여기가 내 평생 정착지가 되어야만 한다.✨ Github.io는 재밌으면서도 귀찮으면서도 뿌듯함이 공존하는 블로그다. 일년 뒤에 돌아봤을 때에는 성실함이 묻어나는 블로그가 되길 소망한다. 아직 댓글기능이랑, 글 날짜 보여주기, About 페이지 등등 좀 더 고쳐나가야 할게 많다. 부담가지지 말고 한개씩 추가해야겠다…...","categories": ["Daily"],
        "tags": [],
        "url": "/daily/start/",
        "teaser": null
      },{
        "title": "[Spring 강의] Spring이란?",
        "excerpt":"1. Spring 이란? Spring 은 특정한 하나를 뜻하는게 아니라, 여러 기술들의 모음이라고 볼 수 있다. Ex) 스프링 홈페이지 스프링 프레임워크, 스프링 부트를 포함하여, 프스필 데이터, 스프링 세션, 스프링 시큐리티 등..을 포함한다. 가장 큰 핵심은 스프링 프레임워크이고 ,이를 편리하게 쓸 수 있도록 하는게 스프링 부트이다. 요즘은 스프링 부트를 주로 활용해서 스프링...","categories": ["Spring 강의"],
        "tags": [],
        "url": "/spring%20%EA%B0%95%EC%9D%98/Spring-%EA%B0%95%EC%9D%98-Spring%EC%9D%B4%EB%9E%80/",
        "teaser": null
      },{
        "title": "[Setting] Java 버전 바꾸기",
        "excerpt":"자바 버전 바꾸기 Mac OS에는 여러 버전의 자바를 설치하고, 상황에 따라 버전을 바꾸어 가며 사용할 수 있다. 자바 여러 버전 설치하는 방법 내가 사용 했던 방식은 총 두가지 이다. 홈페이지 가서 다운로드 받기 homebrew로 설치하기 1. 홈페이지 가서 다운로드 받기  ☕️ Java 홈페이지 에 가서 자신이 필요한 파일을 다운로드 받은...","categories": ["Setting"],
        "tags": [],
        "url": "/setting/Setting-Java%EB%B2%84%EC%A0%84%EB%B0%94%EA%BE%B8%EA%B8%B0/",
        "teaser": null
      },{
        "title": "[Project] Nuxt.js 프로젝트 시작하기",
        "excerpt":"친구와 프로젝트를 하나 시작해보려고 한다.😊 이번에 프론트앤드로 Nuxt.js를 사용하게 되었다. ex) NustJs 공식홈페이지 그래서 처음으로 프로젝트를 생성하고 실행하는 과정을 정리해보고자 한다. yarn 설치하기 #brew로 yarn 설치하기 $ brew install yarn #설치 되었는지 확인하기 $ yarn 위와 같이 설치가 되었음을 알 수 있다. Next.js 프로젝트 만들기 #프로젝트 만들기 #yarn create nuxt-app...","categories": ["Project"],
        "tags": [],
        "url": "/project/Setting-Nuxt.js-%ED%94%84%EB%A1%9C%EC%A0%9D%ED%8A%B8-%EC%8B%9C%EC%9E%91%ED%95%98%EA%B8%B0/",
        "teaser": null
      },{
        "title": "[Spring 강의] Spring 프로젝트 생성",
        "excerpt":"1. 프로젝트 생성 🌿 Start spring 에 가서 프로젝트를 생성! 가장 안정화된 최신버전을 사용한다. (SNAPSHOT이나 M 버전은 아직 안정화 된 버전이 아님) Artifact가 결과적으로 프로젝트 빌드명이 되는 것! 보통 Packaging은 jar을 사용한다. Dependencies는 아무것도 선택하지 않으면 코어 쪽 라이브러리만 가지고 가장 간단하게 구성해 준다. 그 후, zip파일을 다운로드 받은 뒤에 인텔리제이로...","categories": ["Spring 강의"],
        "tags": [],
        "url": "/spring%20%EA%B0%95%EC%9D%98/Spring-%EA%B0%95%EC%9D%98-Spring-%ED%94%84%EB%A1%9C%EC%A0%9D%ED%8A%B8-%EC%83%9D%EC%84%B1/",
        "teaser": null
      },{
        "title": "[Project] MAMP 로컬 서버 구축하기",
        "excerpt":"MAMP란? MAMP를 사용하면 로컬에 PHP,웹 서버, MySQL서버 환경 구축을 한번에 할 수 있다. 이번 프로젝트를 진행할 때 MAMP를 사용하기로 결정! MAMP 설치 🐘 MAMP 홈페이지에 가서 자신의 컴퓨터 환경에 알맞게 다운로드 한 뒤, pkg 파일을 설치하면 된다. MAMP 사용하기 설치한 뒤에 처음으로 열어보면, 아래와 같은 모습이다. 오른쪽의 start 버튼을 누르기 전에...","categories": ["Project"],
        "tags": [],
        "url": "/project/Setting-MAMP-%EC%84%A4%EC%A0%95%ED%95%98%EA%B8%B0/",
        "teaser": null
      },{
        "title": "[Daily] SQLD 시험 후기",
        "excerpt":"SQLD 시험 후기 살면서 이정도 턱걸이 합격은 본적이 없다. 두눈을 의심했다.. 삼일 공부하고 시험봐서 이거 붙을려나… 하고 시험만 보고 오자라는 마음으로 갔는데 참 결과가 재밌다. 노란색 책을 풀면서 생각보다 난이도가 높아서 오..? 생각보다 어려운데 삼일컷은 너무 벼락치기 라는 생각이 들었다. 하지만 노란색책은 SQLP까지 커버하는 난이도 였나보다. 막상 시험장에서 문제는 훨씬...","categories": ["Daily"],
        "tags": [],
        "url": "/daily/Daily-SLQD-%EB%B6%99%EC%97%88%EB%8B%A4/",
        "teaser": null
      },{
        "title": "[Project] Nuxt.js 구조 알아보기",
        "excerpt":"디렉토리 구조 알아보기 +수정 중…. 내가 이해한대로 정리하는 중 미완성.. 1. assets : css 파일, sccs 파일 담아 놓는 곳 scss는 css와 비슷하지만, 구조에 맞에 괄호 맞게 사용 할 수 있어서 상대적으로 구조 파악에 훨씬 쉽다. 즉, 컴포넌트 이해가 쉽다. 안에 내용물은 css랑 똑같지만 형식만 다르다고 보면 된다. 아직 처음이여서...","categories": ["Project"],
        "tags": [],
        "url": "/project/Project-Nuxt.js-%EC%95%8C%EC%95%84%EB%B3%B4%EA%B8%B0/",
        "teaser": null
      },{
        "title": "[Algorithm] 백준_2056번: 작업",
        "excerpt":"3일 전부터 하루에 한 문제씩 남자친구랑 같이 풀고 있다! 오늘의 문제는 🚀백준 2056번: 작업이다. 테스트케이스 그림그리고 이해하는데 오래 걸려서, 이럴려면 되려나 하고 코드 썼는데 한번에 풀렸다~! 만세~! 테스트케이스 이해하기 테스트 케이스를 이해하고자 그림을 그려봤다. 그리다가 느낀게 앞에서 부터 차근차근 계산하면 되겠다라는 생각이들었다. 알고리즘 각 작업이 끝나는 시간을 계산해 놓기 위한...","categories": ["백준"],
        "tags": [],
        "url": "/%EB%B0%B1%EC%A4%80/Algorithm-%EB%B0%B1%EC%A4%80-2056-%EC%9E%91%EC%97%85/",
        "teaser": null
      },{
        "title": "[Algorithm] 백준_16917번: 양념반 후라이드반",
        "excerpt":"오늘의 문제는 🚀 백준 16917번: 양념반 후라이드반 이다. 쉬운 문제라던데 나만 어려웠나보다…😂 수학문제라서 그런가 시간이 조금 오래걸렸다.. 자꾸 예외케이스가 생겨서..ㅠ 테스트케이스 이해하기 input: 양념치킨 가격, 후라이드 가격, 반반 가격, 양념 갯수, 후라이드 갯수 위의 경우는 설명처럼 반반 치킨 4마리와 양념 1마리를 사는게 7900원으로 가장 적다. 하지만 위의 경우는 치킨을 조건...","categories": ["백준"],
        "tags": [],
        "url": "/%EB%B0%B1%EC%A4%80/Algorithm-%EB%B0%B1%EC%A4%80-16917-%EC%96%91%EB%85%90%EB%B0%98-%ED%9B%84%EB%9D%BC%EC%9D%B4%EB%93%9C%EB%B0%98/",
        "teaser": null
      },{
        "title": "[Algorithm] 백준_16922번: 로마 숫자 만들기",
        "excerpt":"오늘의 문제는 🚀 백준 16922번: 로마 숫자 만들기이다. 왜 맨날 어려울까.. 슬프다 대충 콤비네이션으로 계산했을 때, 4^20개의 경우가 나와서 어떻게 해야하지 고민을 많이 했다. 고민고민하다 힌트를 얻어서 풀어보니, n개를 각각 잘 배분해서 중복을 없애는 방법이 답이라고 생각했다. 테스트케이스 이해하기 처음에 콤비네이션을 구한 다음에 중복한 n개 만큼 더해주면 될거라 생각해서 간단할...","categories": ["백준"],
        "tags": [],
        "url": "/%EB%B0%B1%EC%A4%80/Algorithm-%EB%B0%B1%EC%A4%80-16922-%EB%A1%9C%EB%A7%88%EC%88%AB%EC%9E%90-%EB%A7%8C%EB%93%A4%EA%B8%B0/",
        "teaser": null
      },{
        "title": "[Algorithm] 백준_16924번: 십자가 찾기",
        "excerpt":"오늘의 문제는 🚀 백준_16924번: 십자가 찾기이다. ..주말을 즐기다가 오늘안에 해결하지 못했다. 껄껄 그리고 문제 자체가 어려운 것도 한몫 한다…😂 테스트케이스 이해하기 위의 그림 처럼 *로 만들어진 십자가를 주어진 Input에서 찾는 문제이다. 결과값은 input에서 총 3개의 십자가를 찾을 수 있다는 것이다! (3,4)에 길이가 1인 십자가 (3,5)에 길이가 2인 십자가 (3,5)에 길이가...","categories": ["백준"],
        "tags": [],
        "url": "/%EB%B0%B1%EC%A4%80/Algorithm-%EB%B0%B1%EC%A4%80-16924-%EC%8B%AD%EC%9E%90%EA%B0%80-%EC%B0%BE%EA%B8%B0/",
        "teaser": null
      },{
        "title": "[Algorithm] 백준_1592번: 달팽이2",
        "excerpt":"오늘의 문제는 🚀 백준 1592번: 달팽이2이다. 분명 브론즈..인데 왜 때문에 못풀겠지..? 내 실력 눈감아😂 테스트케이스 이해하기 입력으로 숫자가 주어지면 n * m 크기의 어레이를 꺽어가면서 돌때 몇번이 꺽이는지 찾는 것이다. 1차 시도 : 실패 이 시도는…마지막 한줄이 꺽이지 않고 쭉 이어질때 해결하지 못한다.. 허흑 알고리즘 이차원 배열 모서리를 다 돈다....","categories": ["백준"],
        "tags": [],
        "url": "/%EB%B0%B1%EC%A4%80/Algorithm-%EB%B0%B1%EC%A4%80-1592-%EB%8B%AC%ED%8C%BD%EC%9D%B42/",
        "teaser": null
      },{
        "title": "[Algorithm] 백준_1959번: 달팽이3",
        "excerpt":"오늘의 추가 문제는 🚀 백준 1959번: 달팽이3 이다. 2번이랑 내용이 똑같네! 이러면서 덤볐다가 input을 보고.. 이것은… 일반적인 구현방법으로 절대 풀수 없다는 걸 깨달았다. 흑. 왠지 정답률 퍼센티지가 낮더라.. 테스트케이스 이해하기 달팽이 2랑 비슷한데, 어디서 끝나는지 좌표까지 프린트 해야한다! 알고리즘 이건 규칙을 찾고 수학적으로 풀어야 한다고 생각을 했기 때문에, 여러 방법을 시도했지만...","categories": ["백준"],
        "tags": [],
        "url": "/%EB%B0%B1%EC%A4%80/Algorithm-%EB%B0%B1%EC%A4%80-1959-%EB%8B%AC%ED%8C%BD%EC%9D%B43/",
        "teaser": null
      },{
        "title": "[Algorithm] 백준_1697번: 숨바꼭질",
        "excerpt":"오늘의 예비문제는 🚀 백준 1697 숨바꼭질 이다. 사실 숨바꼭질3이 오늘의 문제인데, 이 스리즈물의 일번부터 뭐였는지 기억이 안나서 다시 풀었다. 테스트케이스 이해하기 수빈이랑 동생이랑 숨바꼭질을 해서, 수빈이가 찾으러 가는 것이다. 이동할 수 있는 방법은 +1, -1, *2 방법이 있고 이동할때 마다 1초씩 흐른다. 가장 빠른 시간을 출력하면 성공! 알고리즘 BFS로 문제를 풀어야...","categories": ["백준"],
        "tags": [],
        "url": "/%EB%B0%B1%EC%A4%80/Algorithm-%EB%B0%B1%EC%A4%80-1697-%EC%88%A8%EB%B0%94%EA%BC%AD%EC%A7%88/",
        "teaser": null
      },{
        "title": "[Algorithm] 백준_13349번: 숨바꼭질3",
        "excerpt":"드디어 오늘의 문제는 🚀 백준 13539 숨바꼭질3 이다. 이것도 숨바꼭질과 비슷하지만, *2가 순간이동이기 때문에 시간이 걸리지 않는다…! 테스트케이스 이해하기 이것도 수빈이랑 동생이랑 숨바꼭질을 해서, 수빈이가 찾으러 가는 것이다. 이동할 수 있는 방법은 +1, -1, *2 방법이 있고, +1, -1 씩 이동할때는 1씩 시간이 걸리지만, *2 은 순간이동이여서 시간이 걸리지 않는다. 그럼...","categories": ["백준"],
        "tags": [],
        "url": "/%EB%B0%B1%EC%A4%80/Algorithm-%EB%B0%B1%EC%A4%80-13549-%EC%88%A8%EB%B0%94%EA%BC%AD%EC%A7%883/",
        "teaser": null
      },{
        "title": "[Algorithm] 백준_13913번: 숨바꼭질4",
        "excerpt":"오늘의 예비문제2는 🚀 백준 13913 숨바꼭질4 이다. 숨바꼭질과 거의 유사하지만, 자신이 거쳐온 과정도 같이 프린트 해줘야 한다! 테스트케이스 이해하기 수빈이랑 동생이랑 숨바꼭질을 해서, 수빈이가 찾으러 가는 것이다. 이동할 수 있는 방법은 +1, -1, *2 방법이 있고 이동할때 마다 1초씩 흐른다. 가장 빠른 시간과 함께 거쳐온 위치를 프린트 해주면 된다! 알고리즘 기본...","categories": ["백준"],
        "tags": [],
        "url": "/%EB%B0%B1%EC%A4%80/Algorithm-%EB%B0%B1%EC%A4%80-13913-%EC%88%A8%EB%B0%94%EA%BC%AD%EC%A7%884/",
        "teaser": null
      },{
        "title": "[Algorithm] 백준_14226번: 이모티콘",
        "excerpt":"오늘의 추가 문제는 🚀 백준 14226 이모티콘 이다. BFS를 뿌셔보자라는 마음으로 열심히 풀었다. 테스트케이스 이해하기 위 쓰여있는 것처럼 세가지 경우가 있는데, 이 케이스를 활용해서 원하는 이모티콘 갯수만큼 만드는 문제이다. 알고리즘 이번 문제를 풀면서 BFS의 문제의 정점과 간선을 설정하는게 얼마나 중요한지 배울 수 있었다. x= 화면 이모티콘 갯수, y=클립보드 이모티콘 갯수 즉...","categories": ["백준"],
        "tags": [],
        "url": "/%EB%B0%B1%EC%A4%80/Algorithm-%EB%B0%B1%EC%A4%80-14226-%EC%9D%B4%EB%AA%A8%ED%8B%B0%EC%BD%98/",
        "teaser": null
      },{
        "title": "[SQL] SQL 정리",
        "excerpt":"🚀 프로그래머스 SQL 문제풀기🚀 SELECT 어린 동물 찾기 SELECT ANIMAL_ID, NAME FROM ANIMAL_INS WHERE INTAKE_CONDITION != \"Aged\" SELECT ANIMAL_ID, NAME FROM ANIMAL_INS WHERE not INTAKE_CONDITION = \"Aged\" 여러기준으로 정렬하기 SELECT ANIMAL_ID, NAME, DATETIME FROM ANIMAL_INS ORDER by NAME , DATETIME DESC 상위 n개 레코드 -- 코드를 입력하세요 SELECT NAME FROM...","categories": ["SQL"],
        "tags": [],
        "url": "/sql/Algorithm-SQL-%EA%B3%B5%EB%B6%80%ED%95%98%EA%B8%B0/",
        "teaser": null
      },{
        "title": "[Algorithm] 백준_10026번: 적록색약",
        "excerpt":"오늘의 문제는 🚀 백준 10026 적록색약이다. 이제 BFS 돌리는건 자신 있는데 여러 군데서 돌리는건 어떻게 하는게 가장 최선일지 모르겠다. 이번엔 그냥 풀기만 하자라는 마음으로 이중 포문을 돌려버렸는데 통과가 되어버렸다! 테스트케이스 이해하기 적록색약을 가진 사람은 R과 G를 구분하지 못한다. 그래서 위의 입력 값을 봤을때 각각 4개의 구역, 3개의 구역 이렇게 있다고 판단한다....","categories": ["백준"],
        "tags": [],
        "url": "/%EB%B0%B1%EC%A4%80/Algorithm-%EB%B0%B1%EC%A4%80-10026-%EC%A0%81%EB%A1%9D%EC%83%89%EC%95%BD/",
        "teaser": null
      },{
        "title": "[Algorithm] 백준_1261번: 알고스팟",
        "excerpt":"오늘의 추가 문제는 🚀 백준 1261 알고스팟이다. 아 굉장한 실수로 인해.. 시간을 많이 잡아먹고 결국 혼자서 해결을 못하고 구글미트로 SOS을 요청했다. 테스트케이스 이해하기 최소한 벽을 부셔서 m,n에 도착해야 한다. p.s 조금 이상한게 가로 세로를 반대로 입력해준다… 헷갈리니 조심하시길! 알고리즘 몰랐는데 deque에 튜플이랑 리스트가 들어간다고 하더라.. 난 안되길래 q두개씩 선언해서 풀었는데ㅎ..😂 check를...","categories": ["백준"],
        "tags": [],
        "url": "/%EB%B0%B1%EC%A4%80/Algorithm-%EB%B0%B1%EC%A4%80-1261-%EC%95%8C%EA%B3%A0%EC%8A%A4%ED%8C%9F/",
        "teaser": null
      },{
        "title": "[Algorithm] 백준_11653번: 소인수분해",
        "excerpt":"오늘의 문제는 🚀 백준 11653 소인수분해이다. 내일 시험이 있어서 약간 쉬운 문제를 선택하게 되었다! 처음에 보자마자 에라토스테네스의 체로 풀어야 하나 했지만, 더 복잡해 질거 같아서 while문으로 해결했다! 테스트케이스 이해하기 예제처럼, 우리가 수학시간에 구했던 소인수분해를 프린트 해주면 된다! 알고리즘 i를 2로 두고 input값보다 작을 동안 계속 while문을 돌도록 한다. i가 n을 나머지...","categories": ["백준"],
        "tags": [],
        "url": "/%EB%B0%B1%EC%A4%80/Algorithm-%EB%B0%B1%EC%A4%80-11653-%EC%86%8C%EC%9D%B8%EC%88%98-%EB%B6%84%ED%95%B4/",
        "teaser": null
      },{
        "title": "[Algorithm] 백준_1072번: 게임",
        "excerpt":"오늘의 문제는 🚀 백준 1072 게임이다. input이 십억이다… 이럴때는 무조건 이분 탐색으로 풀어야한다. 테스트케이스 이해하기 형택이는 앞으로 절대 지지 않는다. 그럴 경우 승률이 바뀌는 최소 값을 찾는게 이번 문제!! 알고리즘 start와 end 값을 설정해준다. 현재 승률을 구하고 99와 같거나 크면 -1를 프린트 해주고 끝낸다. (이미 틀린 경우가 있기 때문에 승률이 100이...","categories": ["백준"],
        "tags": [],
        "url": "/%EB%B0%B1%EC%A4%80/Algorithm-%EB%B0%B1%EC%A4%80-1072-%EA%B2%8C%EC%9E%84/",
        "teaser": null
      },{
        "title": "[Algorithm] 백준_2143번: 두 배열의 합",
        "excerpt":"오늘의 문제는 🚀 백준 2143 두 배열의 합이다. 어렵다. 컴비네이션을 풀어야 하는줄 알고 끙끙 풀다가 시간이 너무 많이 지나버려서.. 😂 다른 분의 풀이를 참고했다. 테스트케이스 이해하기 부배열이 배열 속의 일정 범위 연속된 값이라는 것을 제대로 이해하지 못했다.. 그냥 부분집합이라고 생각했는데.. 문제를 똑바로 읽자! 그래서 연속된 일정 범위의 각각의 배열들의 부배열의 합이 첫번째로...","categories": ["백준"],
        "tags": [],
        "url": "/%EB%B0%B1%EC%A4%80/Algorithm-%EB%B0%B1%EC%A4%80-2143-%EB%91%90-%EB%B0%B0%EC%97%B4%EC%9D%98-%ED%95%A9/",
        "teaser": null
      },{
        "title": "[Algorithm] 백준_2023번: 신기한 소수",
        "excerpt":"오늘의 문제는 🚀 백준 2023 신기한 소수이다. 아찔한 문제.. 실력이 차근차근 쌓여서 뚝딱뚝딱 풀어버렸으면 좋겠다ㅎ 테스트케이스 이해하기 N자리 숫자 중에서 앞에서 부터 하나씩 숫자를 끊어봐도 다 소수인 숫자를 찾는 문제이다! 1차 시도 : 실패 is_prime만 쓰니깐 ⇒ 시간초과 에라토스테네스의 체 ⇒ 메모리 초과 그 뒤로도 한참을 고민했지만.. 방법을 찾지못해서 SOS를 쳤다. n=int(input())...","categories": ["백준"],
        "tags": [],
        "url": "/%EB%B0%B1%EC%A4%80/Algorithm-%EB%B0%B1%EC%A4%80-2023-%EC%8B%A0%EA%B8%B0%ED%95%9C%EC%86%8C%EC%88%98/",
        "teaser": null
      },{
        "title": "[Algorithm] 백준_16936번: 나3곱2",
        "excerpt":"오늘의 문제는 🚀 백준 16936 나3곱2이다. 오 어려운데 라고 생각했는데 테스트 케이스를 잘 보니깐 금방 풀렸다. 룰루 테스트케이스 이해하기 곱하기2를 하거나 3으로 나누어 질 경우에 3으로 나눈값들이 뒤섞여서 input으로 입력된다. 그러면 그 숫자들의 순서들을 찾으면 된다! 틀린 경우는 존재 하지 않는다. 그래서 주어진 테스트 케이스만 저렇게 찬찬히 봤는데, 마지막에 오는 숫자만...","categories": ["백준"],
        "tags": [],
        "url": "/%EB%B0%B1%EC%A4%80/Algorithm-%EB%B0%B1%EC%A4%80-16936_%EB%82%983%EA%B3%B12/",
        "teaser": null
      },{
        "title": "[Algorithm] 백준_2252번: 줄세우기",
        "excerpt":"오늘의 문제는 🚀 백준 2252 줄세우기이다. 못풀었다. 어렵다. 위상 정렬을 공부하고 풀어보려고 했는데 메모리 초과, 시간초과…😂 테스트케이스 이해하기 주어진 순서들을 고려해서 줄을 세우면 된다. 여러가지 경우가 나온다면 그 중 하나를 프린트 하면 된다. 1차 시도 : 실패 어려운 문제가 아닌데 다른 방법이 왜 생각이 안나는지 모르겠다. 코테 볼때 이러면 멘붕이 올...","categories": ["백준"],
        "tags": [],
        "url": "/%EB%B0%B1%EC%A4%80/Algorithm-%EB%B0%B1%EC%A4%80-2252-%EC%A4%84%EC%84%B8%EC%9A%B0%EA%B8%B0/",
        "teaser": null
      },{
        "title": "[Algorithm] 백준_1463번: 1로 만들기",
        "excerpt":"오늘의 문제는 🚀 백준 1463 - 1로 만들기이다. DP 알고리즘의 시작! 인강이랑 같이 가보자고~ 테스트케이스 이해하기 위의 세가지 방법을 가장 적게 사용해서 1를 만들수 있는 최솟값을 찾는 것이다! 정답코드 해당 문제는 다이나믹 프로그래밍으로 해결해야 해서, 처음은 top-down 방식으로 문제를 해결했다. memo = 최소 연산의 횟수 저장소 memo[n] = (memo[n-1] +1) or...","categories": ["백준"],
        "tags": [],
        "url": "/%EB%B0%B1%EC%A4%80/Algorithm-%EB%B0%B1%EC%A4%80-1463-1%EB%A1%9C-%EB%A7%8C%EB%93%A4%EA%B8%B0/",
        "teaser": null
      },{
        "title": "[Algorithm] 백준_15990번: 123 더하기 5",
        "excerpt":"오늘의 문제는 🚀 백준 15990 - 123 더하기 5이다. 오랜만에 블로그에 글을 쓰네.. 열심히 해라 나자신! 테스트케이스 이해하기 연속해서 같은 수를 쓰지 않고 합으로 각각의 숫자를 표현하는 방법의 수를 찾는 문제이다. 각 숫자를 연속되지 않는 숫자로 합을 나타낼 때 1,2,3 으로 끝나는 경우의 수를 표로 그려보면 일단 위 처럼 나온다. 초록...","categories": ["백준"],
        "tags": [],
        "url": "/%EB%B0%B1%EC%A4%80/Algorithm-%EB%B0%B1%EC%A4%80-15990-123-%EB%8D%94%ED%95%98%EA%B8%B0-5/",
        "teaser": null
      },{
        "title": "[Algorithm] 프로그래머스: 단어변환",
        "excerpt":"오늘의 문제는 🚀 프로그래머스 DFS/BFS - 단어변환이다. 같은 문제를 내가 다시 풀어도 다르게 푸는게 신기해서 글을 쓴다. 조금씩 실력이 쌓이고 있는건가 라는 생각이 들어서 기록해둔다 ;) 테스트케이스 이해하기 begin에서 target으로 알파벳을 하나씩 바꾸어 변환할때 가장 짧은 과정을 찾는 것이다! 만약 없다면 0을 리턴! 알고리즘 Ver.1 일단 두 단어의 각 알파벳이 하나 차이 나는...","categories": ["프로그래머스"],
        "tags": [],
        "url": "/%ED%94%84%EB%A1%9C%EA%B7%B8%EB%9E%98%EB%A8%B8%EC%8A%A4/Algorithm-%ED%94%84%EB%A1%9C%EA%B7%B8%EB%9E%98%EB%A8%B8%EC%8A%A4-%EB%8B%A8%EC%96%B4%EB%B3%80%ED%99%98/",
        "teaser": null
      },{
        "title": "[Daily] github.io 블로그 다시시작!",
        "excerpt":"3월 28일이 되었다. 시간이 정말 빠르다… 1월 한달은 참 열심히 했었는데, 2월 부터는 가뭄이 찾아와버렸다. 꾸준히 이어가는게 어렵다는 걸 다시금 느낀다… 1월 한달 바짝 알고리즘 열심히 공부해서 그런지, 생각보다 일찍 취업을 했다. 서울 상경과 동시에 직장으로 출근을 해서 정신없이 시간이 지나갔다. 뭔가 마음에 여유가 없기도하고 핑계인 것 같기도하고, 깃허브를 잊고...","categories": ["Daily"],
        "tags": [],
        "url": "/daily/%EB%8B%A4%EC%8B%9C%EC%8B%9C%EC%9E%91/",
        "teaser": null
      }]
